khill25/Dreamdrive/Dreamcast/sw/rp2350/rp2350.cpp
	pio_sm_init(pio, sm, offset, &c);
}

int main(void) {
	// Set clock speed to 266MHz (3.76ns per cycle)
	const int freq_khz = 266000;
	// const int freq_khz = 336000;
	// vreg_set_voltage(VREG_VOLTAGE_1_25); // Usually needed for clocks over 266MHz
	bool clockWasSet = set_sys_clock_khz(freq_khz, false);

	// stdio_init_all();
	// gpio 44 is uart0 tx
	stdio_uart_init_full(uart0, DEBUG_UART_BAUD_RATE, 44, -1);

	printf("Clock of %uMhz was set: %u\n", freq_khz / 1000, clockWasSet);
	printf("MCU1- Init pins...\n");

	// init all pins used on for the Dreamcast IDE connection
	// This is from pin 0 to pin 33 for a total of 34 pins
	for (int i = 0; i <= PIN_WR; i++) {
		gpio_init(i);
		gpio_set_dir(i, false); // set to input
	}

	// Some pins that need to be set to output
	// TODO: Figure out which pins need to be set to output
	gpio_init(PIN_IORDY);
	// gpio_set_dir(PIN_IORDY, true);
	// gpio_pull_up(PIN_IORDY);

	gpio_init(PIN_DOPEN);
	gpio_set_dir(PIN_DOPEN, true);
	// gpio_pull_down(PIN_DOPEN);

	gpio_init(PIN_INTRQ);
	gpio_set_dir(PIN_INTRQ, true);
	gpio_put(PIN_INTRQ, INTRQ_DEASSERT); // was 0

	gpio_init(PIN_DMARQ);
	gpio_set_dir(PIN_DMARQ, true); // output

	gpio_init(PIN_DMACK);
	gpio_set_dir(PIN_DMACK, false); // input
	// gpio_pull_up(PIN_DMACK);

	// Setup and start the ide databus programs
	printf("Setting up PIO ide databus programs...\n");
	printf("\tiniting gpio for pio...");
	for(int i = 0; i <= PIN_WR; i++) {
		gpio_init(i);
		gpio_set_function(i, GPIO_FUNC_PIO0);
		pio_gpio_init(pio0, i);
	}
	gpio_set_function(PIN_IORDY, GPIO_FUNC_PIO0);
	pio_gpio_init(pio0, PIN_IORDY);

	// gpio_init(PIN_CS0);
	// gpio_set_function(PIN_CS0, GPIO_FUNC_SIO);
	// gpio_set_dir(PIN_CS0, false);

	// gpio_init(PIN_CS1);
	// gpio_set_function(PIN_CS1, GPIO_FUNC_SIO);
	// gpio_set_dir(PIN_CS1, false);

	gpio_init(PIN_RD);
	gpio_set_function(PIN_RD, GPIO_FUNC_SIO);
	gpio_set_dir(PIN_RD, false);

	gpio_init(PIN_WR);
	gpio_set_function(PIN_WR, GPIO_FUNC_SIO);
	gpio_set_dir(PIN_WR, false);

	
	printf("Setting up register map...");

	// This is used to quickly get the right register, read/write should be handled by whatever is doing the lookup
	// Register Index = Bits = W, R, CS1, CS0, A2, A1, A0 (most->least)
	registerIndex_map[0x4E] = &SPI_registers[SPI_STATUS_REGISTER_INDEX];//&SPI_registers[SPI_ALTERNATE_STATUS_REGISTER_INDEX]; // read
	registerIndex_map[0x2E] = &SPI_registers[SPI_DEVICE_CONTROL_REGISTER_INDEX]; // write

	registerIndex_map[0x50] = &SPI_registers[SPI_DATA_REGISTER_INDEX]; // read
	registerIndex_map[0x30] = &SPI_registers[SPI_DATA_REGISTER_INDEX]; // write

	registerIndex_map[0x31] = &SPI_registers[SPI_FEATURES_REGISTER_INDEX]; // write
	registerIndex_map[0x51] = &SPI_registers[SPI_ERROR_REGISTER_INDEX]; // read

	registerIndex_map[0x52] = &SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX]; // read only
	registerIndex_map[0x53] = &SPI_registers[SPI_SECTOR_NUMBER_REGISTER_INDEX]; // read only

	registerIndex_map[0x54] = &SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX]; // read
	registerIndex_map[0x34] = &SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX]; // write

	registerIndex_map[0x55] = &SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX]; // read
	registerIndex_map[0x35] = &SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX]; // write

	registerIndex_map[0x56] = &SPI_registers[SPI_DRIVE_SELECT_REGISTER_INDEX]; // read
	registerIndex_map[0x36] = &SPI_registers[SPI_DRIVE_SELECT_REGISTER_INDEX]; // write

	registerIndex_map[0x57] = &SPI_registers[SPI_STATUS_REGISTER_INDEX]; // read
	registerIndex_map[0x37] = &SPI_registers[SPI_COMMAND_REGISTER_INDEX]; // write

	// misc registers, these aren't in the gdrom doc but ARE ata registers
	registerIndex_map[0x32] = &SPI_registers[SPI_SECTOR_COUNT_REGISTER_INDEX]; // write

	// Setup a pointer to the status register
	status_register = &SPI_registers[SPI_STATUS_REGISTER_INDEX];

	SPI_registers[SPI_STATUS_REGISTER_INDEX] = 0b01000000; // set drive ready bit
	SPI_registers[SPI_DRIVE_SELECT_REGISTER_INDEX] = 0xA0; // set drive select
	SPI_registers[SPI_SECTOR_COUNT_REGISTER_INDEX] = 0b01;
	SPI_registers[SPI_SECTOR_NUMBER_REGISTER_INDEX] = 0x80; // 4 if apparently this is the code for a "data disc" and it occupies the top 4 bits of the byte

	// For the rest of the values, just use a dump register
	for(int i = 0; i < 128; i++) {
		if (registerIndex_map[i] == 0) {
			registerIndex_map[i] = &SPI_registers[SPI_REGISTER_COUNT]; // Use the SPI_REGISTER_COUNT as a dump register
		}
	}

	// printf("DONE!\n\tSetting up programs...");
	// setup_ata_cs0_read();
	// setup_ata_cs0_write();
	// setup_ata_cs1_read();
	// setup_ata_cs1_write();
	// configure_ata_cs0_read_dma();
	// configure_ata_cs0_write_dma();
	// configure_ata_cs1_read_dma();
	// configure_ata_cs1_write_dma();
	// printf("DONE!\n\tEnabling programs...");
	// pio_sm_set_enabled(pio0, 0, true);
	// pio_sm_set_enabled(pio0, 1, true);
	// pio_sm_set_enabled(pio2, 0, true);
	// pio_sm_set_enabled(pio2, 1, true);
	// printf("DONE!\n");

	printf("DONE!\n\tSetting up programs...");
	setup_ata_bus_handler();
	printf("DONE!\n");

	// Launch the register loop on core 1
	multicore_launch_core1(ide_register_controller_main);

	main_processing_loop();

	printf("\nFATAL ERROR!! Main processing loop has exited\n");
	return 0;
}

volatile uint32_t readWriteLineValues = 0;
void __not_in_flash_func(process_ata_register_access)() {

	// dma_channel_set_irq0_enabled(dma_channel_cs0_read1, true);
	// dma_channel_set_irq0_enabled(dma_channel_cs0_read2, true);
	// dma_channel_set_irq0_enabled(dma_channel_cs0_write1, true);
	// dma_channel_set_irq0_enabled(dma_channel_cs0_write2, true);
	// dma_channel_set_irq0_enabled(dma_channel_cs1_read1, true);
	// dma_channel_set_irq0_enabled(dma_channel_cs1_read2, true);
	// dma_channel_set_irq0_enabled(dma_channel_cs1_write1, true);
	// dma_channel_set_irq0_enabled(dma_channel_cs1_write2, true);

	// uint dmaChannels[] = {
	// 	dma_channel_cs0_read1,
	// 	dma_channel_cs0_read2,
	// 	dma_channel_cs0_write1,
	// 	dma_channel_cs0_write2,
	// 	dma_channel_cs1_read1,
	// 	dma_channel_cs1_read2,
	// 	dma_channel_cs1_write1,
	// 	dma_channel_cs1_write2
	// };

	// volatile uint16_t* dmaATAAddresses[] = {
	// 	&cs0_read_dma_index_address,
	// 	&cs0_read_dma_index_address,
	// 	&cs0_write_dma_index_address,
	// 	&cs0_write_dma_index_address,
	// 	&cs1_read_dma_index_address,
	// 	&cs1_read_dma_index_address,
	// 	&cs1_write_dma_index_address,
	// 	&cs1_write_dma_index_address
	// };
	volatile uint32_t bigbessie = 0;
	pio_sm_set_enabled(pio0, 0, true);

	while(1) {

