khill25/Dreamdrive/Dreamcast/sw/rp2350/rp2350.cpp
		readWriteLineValues = pio_sm_get_blocking(pio0, 0);

		register_index = readWriteLineValues & 0x7F;

		if (writtenRegisterIndex < 5000) {
			writtenRegisters[writtenRegisterIndex++] = register_index;
		}

		selectedRegister = registerIndex_map[register_index];

		// WRITE TO DREAMCAST (write == 1, read == 0)
		// read pin active low (so write is high)
		if ((readWriteLineValues & READ_WRITE_PIN_MASK) == READ_PIN_MASK) {

			pio_sm_put_blocking(pio0, 0, *selectedRegister);
			if (writtenRegisterIndex < 5000 && register_index != 0x4e) {
				writtenRegisters[writtenRegisterIndex++] = 0xAAAA;
				writtenRegisters[writtenRegisterIndex++] = *selectedRegister;
				
				multicore_fifo_push_blocking(register_index);
			}

		// READ FROM DREAMCAST (write == 0, read == 1)
		// write pin active low (so read is high)
		} else if ((readWriteLineValues & READ_WRITE_PIN_MASK) == WRITE_PIN_MASK) {
			if (writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0xBBBB;
			}

			*selectedRegister = pio_sm_get_blocking(pio0, 0);

			if (writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = *selectedRegister;
			}
			
			multicore_fifo_push_blocking(register_index);
			
		} else {
			if (writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0xCCCC;
				writtenRegisters[writtenRegisterIndex++] = readWriteLineValues;
			}
		}

		

		// Check all the dma channels for irq status
		// for(int i = 0; i < 8; i++) {
		// 	if (dma_channel_get_irq0_status(dmaChannels[i])) {
		// 		dma_channel_acknowledge_irq0(dmaChannels[i]);

		// 		if (writtenRegisterIndex < 5000) {
		// 			writtenRegisters[writtenRegisterIndex++] = *dmaATAAddresses[i];
		// 		}
		// 	}
		// }

		// multicore_fifo_push_blocking(register_index);

		// readWriteLineValues = pio_sm_get_blocking(pio0, 0);
		// register_index = (sio_hw->gpio_in & REGISTER_PIN_MASK) >> 16;
		// selectedRegister = registerIndex_map[register_index];

		// if (writtenRegisterIndex < 5000) {
		// 	writtenRegisters[writtenRegisterIndex++] = readWriteLineValues;
		// 	writtenRegisters[writtenRegisterIndex++] = register_index;
		// }

		// if (readWriteLineValues == 0) {
		// 	if (writtenRegisterIndex < 5000) {
		// 		writtenRegisters[writtenRegisterIndex++] = *selectedRegister;
		// 	}

		// 	pio_sm_put_blocking(pio0, 0, *selectedRegister);

		// } else if (readWriteLineValues == 1) {
		// 	*selectedRegister = pio_sm_get_blocking(pio0, 0);

		// 	if (writtenRegisterIndex < 5000) {
		// 		writtenRegisters[writtenRegisterIndex++] = *selectedRegister;
		// 	}
		// }

		// do {
		// 	readWriteLineValues = sio_hw->gpio_in & CS_PINS_MASK;
		// } while(readWriteLineValues == CS_PINS_MASK || readWriteLineValues == 0x00000);			// 12ns (3 cycles)

		// do {
		// 	readWriteLineValues = sio_hw->gpio_in & READ_WRITE_PIN_MASK;
		// } while(readWriteLineValues == READ_WRITE_PIN_MASK || readWriteLineValues == 0x00000);

		// // Chatgpt suggested this, it seems to execute MUCH faster
		// // Something about branch prediction taking a long time and the compiler directive 
		// // fixes that
		// // do {
		// // 	readWriteLineValues = sio_hw->gpio_in & (CS_PINS_MASK | READ_WRITE_PIN_MASK);
		// // } while(__builtin_expect(readWriteLineValues == (CS_PINS_MASK | READ_WRITE_PIN_MASK) || readWriteLineValues == 0x00000, 0));
		
		// // gpio_put(PIN_IORDY, 0);

		// // Figure out the register index and get the pointer to the selected register
		// register_index = (sio_hw->gpio_in & REGISTER_PIN_MASK) >> 16; // shift by 16 to offset the data pins (0-15)
		// selectedRegister = registerIndex_map[register_index];

		// // Read from register send to Dreamcast
		// if ((register_index & BIT_SHIFTED_READ_PIN_MASK) == BIT_SHIFTED_READ_PIN_MASK) {
		// 	pio0->txf[IDE_WRITE_TO_HOST_SM] = *selectedRegister;

		// 	multicore_fifo_push_blocking(register_index);
		// 	// core_command_buffer[core0_buffer_index++] = register_index;

		// 	gpio_put(PIN_IORDY, 1);
		// 	// wait for latch
		// 	while(gpio_get(PIN_RD) == 0) { tight_loop_contents(); };
			
		// 	// Send a signal to pio to let it go back to input
		// 	pio0->txf[IDE_WRITE_TO_HOST_SM] = 0;
			
		// 	gpio_put(PIN_IORDY, 0);

		// // Write to Dreamcast from register
		// } else {
		// 	// Let pio know we are ready to read data
		// 	pio0->txf[IDE_READ_FROM_HOST_SM] = 1;
		// 	*selectedRegister = pio_sm_get_blocking(pio0, IDE_READ_FROM_HOST_SM);

		// 	if (register_index != 0x4e) {
		// 		multicore_fifo_push_blocking(register_index);
		// 	}
		// 	// core_command_buffer[core0_buffer_index++] = register_index;

		// 	gpio_put(PIN_IORDY, 1);
		// 	// wait for latch
		// 	while(gpio_get(PIN_WR) == 0) { tight_loop_contents(); };
		// 	gpio_put(PIN_IORDY, 0);
		// }
	}
}

void ide_register_controller_main() {


	uint32_t t = 0x30;
	uint32_t t1 = t & WRITE_PIN_MASK;
	uint32_t t2 = t & READ_PIN_MASK;
	uint32_t t3 = t & READ_WRITE_PIN_MASK;
	printf("%x, %x, %x\n", t1, t2, t3); // 20, 0, 20

	printf("Dreamcast booting...\n");

	// The Dreamcast(something?) does a startup with the cd drive and it toggles all the control, read, and write lines.
	// Not sure if this is real data or just a fun little startup sequence

	while(!gpio_get(PIN_CS0)); // loop until the cs lines are active (really only useful when powering the board on before the console)

	printf("Dreamcast booted!\n");

	busy_wait_ms(1000); // TODO this is likely not needed? 

	selectedRegister = registerIndex_map[SPI_REGISTER_COUNT];
	volatile uint8_t dreamcastWantsRead = 0;
	// 00 (0x0) - nothing
	// 01 (0x1) - read
	// 10 (0x2) - write
	// 11 (0x3) - nothing

	// By using the IORDY pin, we can slow down the control signaling.
	// This makes it a lot slower to read/write to the dreamcast but does at least work
	// TODO: Figure out how to do this without the IORDY pin to speed up the control processing
	gpio_put(PIN_IORDY, 1);

	process_ata_register_access();

	// while(1) {

	// 	do {
	// 		readWriteLineValues = sio_hw->gpio_in & CS_PINS_MASK;
	// 	} while(readWriteLineValues == CS_PINS_MASK || readWriteLineValues == 0x00000);			// 12ns (3 cycles)

	// 	do {
	// 		readWriteLineValues = sio_hw->gpio_in & READ_WRITE_PIN_MASK;
	// 	} while(readWriteLineValues == READ_WRITE_PIN_MASK || readWriteLineValues == 0x00000);

	// 	// Chatgpt suggested this, it seems to execute MUCH faster
	// 	// Something about branch prediction taking a long time and the compiler directive 
	// 	// fixes that
	// 	// do {
	// 	// 	readWriteLineValues = sio_hw->gpio_in & (CS_PINS_MASK | READ_WRITE_PIN_MASK);
	// 	// } while(__builtin_expect(readWriteLineValues == (CS_PINS_MASK | READ_WRITE_PIN_MASK) || readWriteLineValues == 0x00000, 0));
		
	// 	// gpio_put(PIN_IORDY, 0);

	// 	// Figure out the register index and get the pointer to the selected register
	// 	register_index = (sio_hw->gpio_in & REGISTER_PIN_MASK) >> 16; // shift by 16 to offset the data pins (0-15)
	// 	selectedRegister = registerIndex_map[register_index];

	// 	// Read from register send to Dreamcast
	// 	if ((register_index & BIT_SHIFTED_READ_PIN_MASK) == BIT_SHIFTED_READ_PIN_MASK) {
	// 		pio0->txf[IDE_WRITE_TO_HOST_SM] = *selectedRegister;

	// 		multicore_fifo_push_blocking(register_index);
	// 		// core_command_buffer[core0_buffer_index++] = register_index;

