khill25/Dreamdrive/Dreamcast/sw/rp2350/rp2350.cpp
	// 		gpio_put(PIN_IORDY, 1);
	// 		// wait for latch
	// 		while(gpio_get(PIN_RD) == 0) { tight_loop_contents(); };
			
	// 		// Send a signal to pio to let it go back to input
	// 		pio0->txf[IDE_WRITE_TO_HOST_SM] = 0;
			
	// 		gpio_put(PIN_IORDY, 0);

	// 	// Write to Dreamcast from register
	// 	} else {
	// 		// Let pio know we are ready to read data
	// 		pio0->txf[IDE_READ_FROM_HOST_SM] = 1;
	// 		*selectedRegister = pio_sm_get_blocking(pio0, IDE_READ_FROM_HOST_SM);

	// 		if (register_index != 0x4e) {
	// 			multicore_fifo_push_blocking(register_index);
	// 		}
	// 		// core_command_buffer[core0_buffer_index++] = register_index;

	// 		gpio_put(PIN_IORDY, 1);
	// 		// wait for latch
	// 		while(gpio_get(PIN_WR) == 0) { tight_loop_contents(); };
	// 		gpio_put(PIN_IORDY, 0);
	// 	}
	// }

	printf("\nERROR!!! Register controller core main loop ended.\n");
}

uint32_t timetrack = 0;
bool hasChirped = false;
volatile uint32_t core0CData = 0;
volatile uint16_t core0commandRegister = 0;
volatile uint16_t* spi_packet_register = 0;
volatile uint8_t spi_packet_word_count = 0;
volatile uint16_t generic_data_buffer[64] = {0}; // Basic buffer to send data for things like req_ses, error, etc

#define DATA_MODE_IDLE 		(0)
#define DATA_MODE_SPI 		(1) // Sega SPI packet mode, processing their 12 byte packets
#define IDE_TRANSFER_MODE_PIO (0)
#define IDE_TRANSFER_MODE_DMA (1)
static uint8_t ide_current_mode = DATA_MODE_IDLE;
static uint8_t ide_current_transfer_mode = 0; // 0 = PIO, 1 = DMA

static uint8_t command71Flag = 0;
static uint16_t* rom; 

#define IO_MODE_IDLE 0
#define IO_MODE_WRITE 1
#define IO_MODE_READ 2
static uint8_t current_io_mode = 0;
// In other code bases, this is part of the state variable for data mode, but
// knowing which packet command is being processed is fine for now.
// There may be a point when we need to change to a better state machine.
// But that will likely require rethinking the whole flow.
static uint8_t current_io_packet_command = 0; // This is just the current SPI packet command we are processing, useful for sending canned responses vs actual data

// Bake the offset into the starting and ending positions
static uint32_t io_current_position = 0;
static uint32_t io_ending_position = 0;
volatile uint8_t secnr_poll_count = 0;
volatile uint8_t secnr_poll_next_status = 0x80;

void process_packet() {
	current_io_packet_command = SEGA_PACKET_CMD_REGISTER[0];
	ide_current_mode = DATA_MODE_IDLE;
	// Get and set transfer mode from the features register
	ide_current_transfer_mode = SPI_registers[SPI_FEATURES_REGISTER_INDEX] & 1;

	// printf("packet: ");
	// for(int i = 0; i < 12; i++) {
	// 	printf("%x ", SEGA_PACKET_CMD_REGISTER[i]);
	// }
	// printf("\n");

	if (writtenRegisterIndex < 5000) {
		writtenRegisters[writtenRegisterIndex++] = 0xDAAAAAAA;
		writtenRegisters[writtenRegisterIndex++] = SEGA_PACKET_CMD_REGISTER[0];
		writtenRegisters[writtenRegisterIndex++] = 0xAAAAAAAD;
	}

	switch(current_io_packet_command) {
		case 0x70:
		if(writtenRegisterIndex < 5000) {
			writtenRegisters[writtenRegisterIndex++] = 0x70FFFFFF;
		}
		case TEST_UNIT_SEGA_PACKET_CMD: {
			*status_register = 0x50; // only drive ready bit set
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
			SPI_registers[SPI_ERROR_REGISTER_INDEX] = 0x00; // no error

			// Set interrupt bit and assert line
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);
			break;
		}
		case REQ_STAT_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x11111111;
			}
			break;
		}
		case REQ_MODE_SEGA_PACKET_CMD: {
			uint startingAddress = SEGA_PACKET_CMD_REGISTER[2];
			uint length = SEGA_PACKET_CMD_REGISTER[4];	

			uint halfLength = length/2; // Divide by two because we are sending 2 bytes at a time (16bit bus)
				
			// Setup the IO infos
			current_io_mode = IO_MODE_WRITE;
			io_current_position = (1976 + startingAddress) / 2; //startingAddress / 2;
			io_ending_position = io_current_position + halfLength;
			ide_current_transfer_mode = IDE_TRANSFER_MODE_PIO;
			
			// put first word in data register
			// SPI_registers[SPI_DATA_REGISTER_INDEX] = reply_11[io_current_position++];
			SPI_registers[SPI_DATA_REGISTER_INDEX] = rom[io_current_position++];

			// Put the correct values in the registers
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x02; // IO=1, CoD=0
			SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX] = 0;
			SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX] = length;
			*status_register = 0x58; // DRQ = 1 BSY = 0 

			// set irq
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);

			// // TODO icegdrom does this with 3 specific cases but nulldc just has a whole canned response array
			// // and none of this specific address checking. Might be worth condensing this without any magic numbers
			// if (startingAddress == 18 && length == 8) {
			// 	uint halfLength = length/2; // Divide by two because we are sending 2 bytes at a time (16bit bus)
				
			// 	// Setup the IO infos
			// 	current_io_mode = IO_MODE_WRITE;
			// 	io_current_position = (1976 + startingAddress) / 2; //startingAddress / 2;
			// 	io_ending_position = io_current_position + halfLength;
			// 	ide_current_transfer_mode = IDE_TRANSFER_MODE_PIO;
				
			// 	// put first word in data register
			// 	// SPI_registers[SPI_DATA_REGISTER_INDEX] = reply_11[io_current_position++];
			// 	SPI_registers[SPI_DATA_REGISTER_INDEX] = rom[io_current_position++];

			// 	// Put the correct values in the registers
			// 	SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x02; // IO=1, CoD=0
			// 	SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX] = 0;
			// 	SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX] = 8; // length is 8 bytes
			// 	*status_register = 0x58; // DRQ = 1 BSY = 0 

			// 	// set irq
			// 	gpio_put(PIN_INTRQ, INTRQ_ASSERT);

			// } else if (startingAddress == 0 && length == 10) {
			// 	if(writtenRegisterIndex < 5000) {
			// 		writtenRegisters[writtenRegisterIndex++] = 0x011F0F10;
			// 	}
				
			// 	// Setup the IO infos
			// 	current_io_mode = IO_MODE_WRITE;
			// 	io_current_position = startingAddress / 2;
			// 	io_ending_position = (startingAddress / 2) + (length / 2);
			// 	ide_current_transfer_mode = IDE_TRANSFER_MODE_PIO;
				
			// 	// put first word in data register
			// 	SPI_registers[SPI_DATA_REGISTER_INDEX] = reply_11[io_current_position++];

			// 	// Put the correct values in the registers
			// 	SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x02; // IO=1, CoD=0
			// 	SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX] = length >> 8;
			// 	SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX] = length & 0xFF;
			// 	*status_register = 0x58; // DRQ = 1 BSY = 0 

			// 	// set irq
			// 	gpio_put(PIN_INTRQ, INTRQ_ASSERT);

