khill25/Dreamdrive/Dreamcast/sw/rp2350/rp2350.cpp
			// } else {
			// 	// finish packet by setting an error
			// 	if(writtenRegisterIndex < 5000) {
			// 		writtenRegisters[writtenRegisterIndex++] = 0xDEADDEAD;
			// 	}
			// }

			break;
		}
		case SET_MODE_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x22222222;
			}

			uint startingAddress = SEGA_PACKET_CMD_REGISTER[2];
			uint length = SEGA_PACKET_CMD_REGISTER[4];	
			
			if (length == 0) {
				writtenRegisters[writtenRegisterIndex++] = 0x2222FFFF;
			} else {
				writtenRegisters[writtenRegisterIndex++] = 0x2222AAAA;
			}

			// Setup the IO infos
			current_io_mode = IO_MODE_READ;
			io_current_position = startingAddress / 2;
			io_ending_position = (startingAddress / 2) + (length / 2);
			ide_current_transfer_mode = IDE_TRANSFER_MODE_PIO;
			
			// We will be READING data into the reply 11 array

			// Put the correct values in the registers
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x00; // IO=0, CoD=0

			writtenRegisters[writtenRegisterIndex++] = SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX];
			writtenRegisters[writtenRegisterIndex++] = SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX];

			SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX] = length >> 8;
			SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX] = length & 0xFF;
			*status_register = 0x58; // DRQ = 1 BSY = 0 

			// set irq
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);

			break;
		}
		case REQ_ERROR_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x33333333;
			}
			break;
		}
		case GET_TOC_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x14FFFFFF;
			}
			// TOC is ALWAYS 408 bytes
			current_io_mode = IO_MODE_WRITE;
			io_current_position = 0;
			io_ending_position = 204; // 408 bytes / 2 bytes per word
			// ide_current_transfer_mode = IDE_TRANSFER_MODE_PIO;

			// printf("Read TOC - Double Density: %x:\n", (SEGA_PACKET_CMD_REGISTER[1] & 0x1));
			// for(int i = 0; i < 12; i++) {
			// 	printf("%x ", SEGA_PACKET_CMD_REGISTER[i]);
			// }
			// printf("\n");

			DiskArea tocSelectBit = (SEGA_PACKET_CMD_REGISTER[1] & 0x1) ? DoubleDensity : SingleDensity;
			GetDriveToc((uint32_t*)(SEGA_PACKET_TOC_INFO), tocSelectBit);

			// put first word in data register
			SPI_registers[SPI_DATA_REGISTER_INDEX] = SEGA_PACKET_TOC_INFO_16[io_current_position++];

			// Put the correct values in the registers
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x02; // IO=1, CoD=0
			 // length is 408 bytes which is 0x198 in Hex, so just magic number it
			SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX] = 0x1;
			SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX] = 0x98;
			*status_register = 0x58; // DRQ = 1 BSY = 0 

			// set irq
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);
			
			break;
		}
		case REQ_SES_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x55555555;
			}

			uint sessionNumber = SEGA_PACKET_CMD_REGISTER[2];
			uint length = SEGA_PACKET_CMD_REGISTER[4];	

			current_io_mode = IO_MODE_WRITE;
			io_current_position = 0;
			io_ending_position = 3; // req ses is always 6 bytes, 3 words
			ide_current_transfer_mode = IDE_TRANSFER_MODE_PIO;

			GetDriveSessionInfo((uint8_t*)(generic_data_buffer), sessionNumber);
			((uint8_t*)(generic_data_buffer))[0]= SPI_registers[SPI_SECTOR_NUMBER_REGISTER_INDEX];

			// put first word in data register
			SPI_registers[SPI_DATA_REGISTER_INDEX] = generic_data_buffer[io_current_position++];

			// Put the correct values in the registers
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x02; // IO=1, CoD=0
			SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX] = 0;
			SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX] = 6; // length is 6 bytes
			*status_register = 0x58; // DRQ = 1 BSY = 0 

			// set irq
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);

			break;
		}
		case CD_OPEN_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x66666666;
			}
			break;
		}
		case CD_PLAY_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x77777777;
			}
			break;
		}
		case CD_SEEK_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x88888888;
			}
			break;
		}
		case CD_SCAN_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x99999999;
			}
			break;
		}
		case CD_READ_SEGA_PACKET_CMD: {
			current_io_mode = IO_MODE_WRITE;
			
			// Read and buffer the data
			gdrom_read_start(SEGA_PACKET_CMD_REGISTER, ide_current_transfer_mode);

			if (ide_current_transfer_mode == IDE_TRANSFER_MODE_PIO) {
				printf("cd_read pio\n");
				// Read the first word
				gdrom_read_consume_buffer(&SPI_registers[SPI_DATA_REGISTER_INDEX]);

				// Put the correct values in the registers
				SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x02; // IO=1, CoD=0
				SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX] = gdrom_read_bytes_remanining >> 8;
				SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX] = gdrom_read_bytes_remanining & 0xFF;
				*status_register = 0x58; // DRQ = 1 BSY = 0 

				// set irq
				gpio_put(PIN_INTRQ, INTRQ_ASSERT);
			} else {
				// Fall through to main loop and start the DMA transfer
				if(writtenRegisterIndex < 5000) {
					writtenRegisters[writtenRegisterIndex++] = 0xD8A10000;
				}
			}	

			break;
		}
		case CD_READ2_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x1234BBBB;
			}
			break;
		}
		case GET_SCD_SEGA_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0xCCCCCCCC;
			}

			uint8_t format = SEGA_PACKET_CMD_REGISTER[1] & 0xF;
			uint32_t lengthFromPacket = (SEGA_PACKET_CMD_REGISTER[3] << 8) | (SEGA_PACKET_CMD_REGISTER[4]);
			uint32_t length = lengthFromPacket;
			uint8_t* bufferPtr = (uint8_t*)(generic_data_buffer);
			uint8_t discStatus = SPI_registers[SPI_SECTOR_NUMBER_REGISTER_INDEX] & 0xF;
			
