khill25/Dreamdrive/Dreamcast/sw/rp2350/rp2350.cpp
			/*
			 * Data Format
			 * 0h = All subcode information is transferred as raw data, number of transfer bytes = 96
			 * 1h = Subcode Q data only, 12 bytes
			 * 2h = Media catalog number (UPC/Bar code)
			 * 3h = ISRC code International Standard Recording Code
			 * 4-Fh = reserved
			 */

			// Load the buffer with the correct data
			/*
			 * Byte 0    = reserved
			 * Byte 1    = status
			 * Byte 2,3  = subcode data length 100 = 64h
			 * Byte 4-99 = subcode
			 */

			bufferPtr[0] = 0x00;

			// TODO we aren't actually playing any audio data, but we should probably figure that out. 
			// For now the disc is in standby (sector number = 0x82), so this will return no audio status (0x15)
			if (discStatus == REQ_STAT_INFO_STATUS_PAUSE) {
				bufferPtr[1] = 0x12;
			} else if (discStatus == REQ_STAT_INFO_STATUS_STANDBY) {
				bufferPtr[1] = 0x13;
			} else if (discStatus == REQ_STAT_INFO_STATUS_PLAY) {
				bufferPtr[1] = 0x11;
			} else {
				bufferPtr[1] = 0x15; // no audio status information
			}

			bufferPtr[1] = 0x15;

			if (format == 0) {
				length = 100;
				bufferPtr[2] = 0;
				bufferPtr[3] = 100; // 0x64
				// copy subchannel array?
				memcpy(&bufferPtr[4], q_subchannel, 96);
			} else if (format == 1) {
				length = 0xE; // 14 bytes
				// Data length MSB (0 = 0x0)
				bufferPtr[2] = 0;
				// Data length LSB (14 = 0xE)
				bufferPtr[3] = 0xE;
				// Control(top 4 bits)/ADR (bottom 4 bits)
				bufferPtr[4] = (4<<4) | (1);
				// Copy the rest from nulldc, icegdrom's version looks really complicated :|
				//5-13	DATA-Q
				uint8_t* data_q = &bufferPtr[5-1];
				//-When ADR = 1
				//Byte	Description
				//1	TNO
				data_q[1]=1;//Track number .. duno whats it :P gota parse toc xD ;p
				//2	X
				data_q[2]=1;//gap #1 (main track)
				//3-5	Elapsed FAD within track
				//u32 FAD_el=cdda.CurrAddr.FAD-cdda.StartAddr.FAD;
				data_q[3]=0;//(u8)(FAD_el>>16);
				data_q[4]=0;//(u8)(FAD_el>>8);
				data_q[5]=0;//(u8)(FAD_el>>0);
				//6	0	0	0	0	0	0	0	0
				data_q[6]=0;//
				//7-9	-> seems to be FAD
				data_q[7]=0;//(u8)(cdda.CurrAddr.FAD>>16);
				data_q[8]=0x0;//(u8)(cdda.CurrAddr.FAD>>8);
				data_q[9]=0x96;//(u8)(cdda.CurrAddr.FAD>>0);

			} else {
				// Unsupported, abort!
				printf("SCD format: %x, unsupported\n", format);
			}

			current_io_mode = IO_MODE_WRITE;
			io_current_position = 0;
			io_ending_position = length/2;
			ide_current_transfer_mode = IDE_TRANSFER_MODE_PIO;

			// put first word in data register
			SPI_registers[SPI_DATA_REGISTER_INDEX] = generic_data_buffer[io_current_position++];

			// Put the correct values in the registers
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x02; // IO=1, CoD=0
			SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX] = length >> 8;
			SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX] = length & 0xFF;
			*status_register = 0x58; // DRQ = 1 BSY = 0 

			// set irq
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);

			break;
		}
		case Code71_PACKET_CMD: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x71000000 | SEGA_PACKET_CMD_REGISTER[1];
			}

			uint32_t countData71 = 0;
			if (!command71Flag) {
				// Copy the first 0x3f4 bytes of the rom to the buffer
				io_current_position = 0;
				io_ending_position = 0x3f4/2;
				countData71 = 0x3f4;
				command71Flag = 1;

			} else {
				// Copy the next 0x3c0 bytes of the rom to the buffer
				io_current_position = 0x3f8;
				countData71 = 0x3c0;
				io_ending_position = 0x3c0/2;
				command71Flag = 0;
			}

			current_io_mode = IO_MODE_WRITE;
			// io_current_position = 0;
			// io_ending_position = reply_71_sz/2;
			ide_current_transfer_mode = IDE_TRANSFER_MODE_PIO;

			SPI_registers[SPI_DATA_REGISTER_INDEX] = rom[io_current_position++];
			// SPI_registers[SPI_DATA_REGISTER_INDEX] = reply_71[io_current_position++];
			
			// io_ending_position = sizeof(cmd71_reply)/2;
			// SPI_registers[SPI_DATA_REGISTER_INDEX] = cmd71_reply[io_current_position++];

			// SPI_registers[SPI_SECTOR_NUMBER_REGISTER_INDEX] = 0x81;
			SPI_registers[SPI_SECTOR_NUMBER_REGISTER_INDEX] = 0x83;
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x02; // IO=1, CoD=0
			SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX] = countData71 >> 8;
			SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX] = countData71 && 0xFF; 
			*status_register = 0x58; // DRQ = 1 BSY = 0

			// set irq
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);

			break;
		}
		default: {
			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0xDEAD0000 | current_io_packet_command;
			}
			break;
		}
	}
}

static inline void process_data_written() {

	if (current_io_mode == IO_MODE_READ) {

		if (current_io_packet_command == SET_MODE_SEGA_PACKET_CMD) {

			reply_11[io_current_position++] = SPI_registers[SPI_DATA_REGISTER_INDEX];

			if (io_current_position >= io_ending_position) {
				// for(int i = 0; i < 16; i++) {
				// 	printf("0x%02X ", reply_11[i]);
				// }
				// printf("\n");
				current_io_packet_command = 0;
				io_current_position = 0;
				io_ending_position = 0;
				current_io_mode = IO_MODE_IDLE;

				// Set the status register to indicate the data is finished
				SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
				*status_register = 0x50; // DRQ = 0 BSY = 0
				
				// Assert the IRQ line to announce we are finished
				gpio_put(PIN_INTRQ, INTRQ_ASSERT);
			}

		}

		return;
	}

	// I think this method will ONLY be called when dreamcast is writing a SPI packet
	if(ide_current_mode == DATA_MODE_SPI) {
		spi_packet_register[spi_packet_word_count++] = SPI_registers[SPI_DATA_REGISTER_INDEX];

		// This is the last word of the packet, process it
		if (spi_packet_word_count >= 6) {
			ide_current_mode = DATA_MODE_IDLE;
			spi_packet_word_count = 0;

			process_packet();
		}
	} else {
		// So this else block is likely unneeded but will keep this here for debugging purposes
		if(writtenRegisterIndex < 5000) {
			writtenRegisters[writtenRegisterIndex++] = 0xEEEEEEEE;
		}
		printf("!!error process_data_written- ide_current_mode: %x\n", ide_current_mode);
		for(int i = 0; i < 12; i++) {
			printf("%x ", SEGA_PACKET_CMD_REGISTER[i]);
		}
		printf("\n");
		// TODO might be better to just printf something instead?
	}
}

