khill25/Dreamdrive/Dreamcast/sw/rp2350/rp2350.cpp
static uint32_t dmaTransfersCompleted = 0;
static uint8_t dmaDidTimeout = 0;
static uint32_t numDmackWaits = 0; // timeout
static bool gdrom_buffer_has_more_data = 0;
static inline void process_data_read() {
	// TODO
	// Dreamcast has read the data register. Put the next word in the register

	if(current_io_packet_command == REQ_MODE_SEGA_PACKET_CMD) {
		// SPI_registers[SPI_DATA_REGISTER_INDEX] = reply_11[io_current_position++]; // put next word in data register
		SPI_registers[SPI_DATA_REGISTER_INDEX] = rom[io_current_position++];

		if (io_current_position >= io_ending_position) {
			if (writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x1100FFFF;
			}
			// printf("REQ_MODE finished\n");
			current_io_packet_command = 0;
			io_current_position = 0;
			io_ending_position = 0;
			current_io_mode = IO_MODE_IDLE;

			// Set the status register to indicate the data is finished
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
			*status_register = 0x50; // DRQ = 0 BSY = 0
			
			// Assert the IRQ line to announce we are finished
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);
		}
	} else if (current_io_packet_command == GET_TOC_SEGA_PACKET_CMD) {
		// TODO error handling
		// If the disc image we read doesn't have any TOC we should set error in status register

		// Start sending the TOC
		SPI_registers[SPI_DATA_REGISTER_INDEX] = SEGA_PACKET_TOC_INFO_16[io_current_position++];
		if (io_current_position >= io_ending_position) {
			if (writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x1400FFFF;
			}
			// printf("TOC finished\n");
			current_io_packet_command = 0;
			io_current_position = 0;
			io_ending_position = 0;
			current_io_mode = IO_MODE_IDLE;

			// Set the status register to indicate the data is finished
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
			*status_register = 0x50; // DRQ = 0 BSY = 0
			
			// Assert the IRQ line to announce we are finished
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);
		}

	} else if (current_io_packet_command == REQ_SES_SEGA_PACKET_CMD) {
		SPI_registers[SPI_DATA_REGISTER_INDEX] = generic_data_buffer[io_current_position++]; // put next word in data register

		if (io_current_position >= io_ending_position) {
			if (writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x1500FFFF;
			}
			current_io_packet_command = 0;
			io_current_position = 0;
			io_ending_position = 0;
			current_io_mode = IO_MODE_IDLE;

			// Set the status register to indicate the data is finished
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
			*status_register = 0x50; // DRQ = 0 BSY = 0
			
			// Assert the IRQ line to announce we are finished
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);
		}

	} else if (current_io_packet_command == CD_READ_SEGA_PACKET_CMD) { 
		// read from the sd card and send data from the gdrom_read_buffer
		if (ide_current_transfer_mode == IDE_TRANSFER_MODE_DMA) {
			/*
			 *
			 * DMA Data Transfer Handshake in ATA/ATAPI
			 * 	The two key signals for DMA transfers are:

			 * 	*	DMARQ (DMA Request): Asserted by the device (GD-ROM) when it has data ready to transfer.
			 * 	*	DMACK (DMA Acknowledge): Asserted by the host (Dreamcast) when it is ready to receive data.
			 * 	This forms a handshake mechanism where:

			 * 	1.	GD-ROM sets DMARQ high when it has a word (16-bit) of data ready.
			 * 	2.	Dreamcast sets DMACK low when it is ready to accept data.
			 * 	3.	GD-ROM places data on the bus and waits for the host to acknowledge.
			 * 	4.	Dreamcast deasserts DMACK, signaling the drive to send the next word.
			 * 	5.	Steps 1-4 repeat for each word until the entire transfer is complete.
			 */
			// IMPORTANT: So the approach here is to tie up this core with the DMA transfer.
			// And presumably nothing is happening at the register level because there will
			// be no one to response to commands since this thread wont be popping the core fifo
			// IF this is a problem, we should just work the dma transfer into the main loop

			// if(writtenRegisterIndex < 5000) {
			// 	writtenRegisters[writtenRegisterIndex++] = 0xD8A00000;
			// }

			// do {
				gdrom_buffer_has_more_data = gdrom_read_consume_buffer(&SPI_registers[SPI_DATA_REGISTER_INDEX]); // read in another word
				

				// Put data on the bus
				pio0->txf[IDE_WRITE_TO_HOST_SM] = SPI_registers[SPI_DATA_REGISTER_INDEX];

				// Signal we have data and wait for dreamcast to acknowledge
				gpio_put(PIN_DMARQ, 1);
				while(gpio_get(PIN_DMACK) == 1 && numDmackWaits < 100) { 
					numDmackWaits++;
					tight_loop_contents(); 
				}
				if (numDmackWaits >= 100) {
					dmaDidTimeout = 1;
				}
				numDmackWaits = 0;

				// Dreamcast has acknowledged, send the data, and wait for dreamcast to be ready for the next word
				gpio_put(PIN_DMARQ, 0);
				while(gpio_get(PIN_DMACK) == 0) { tight_loop_contents(); }

				// reset databus for next word
				pio0->txf[IDE_WRITE_TO_HOST_SM] = 0;

				dmaTransfersCompleted++;

			// } while(gdrom_buffer_has_more_data);

			// if(writtenRegisterIndex < 5000) {
			// 	writtenRegisters[writtenRegisterIndex++] = 0xD8A01111;
			// }

			if (dmaDidTimeout) {
				current_io_mode = IO_MODE_IDLE;
				// Set the status register to indicate the data is finished
				SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
				*status_register = 0x50; // DRQ = 0 BSY = 0

				// Do we need to assert the irq line for a read?
				gpio_put(PIN_INTRQ, INTRQ_ASSERT);

				if(writtenRegisterIndex < 5000) {
					writtenRegisters[writtenRegisterIndex++] = dmaTransfersCompleted;
					writtenRegisters[writtenRegisterIndex++] = 0xD8A07777;
					dmaTransfersCompleted = 0;
				}

				return;
			}
			
			if (!gdrom_buffer_has_more_data) {
				// All the data has been sent, signal the end of the transfer
				current_io_mode = IO_MODE_IDLE;
				// Set the status register to indicate the data is finished
				SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
				*status_register = 0x50; // DRQ = 0 BSY = 0

				// Do we need to assert the irq line for a read?
				gpio_put(PIN_INTRQ, INTRQ_ASSERT);

				if(writtenRegisterIndex < 5000) {
					writtenRegisters[writtenRegisterIndex++] = 0xD8A01111;
				}
			}

		// PIO
		} else {
			gdrom_buffer_has_more_data = gdrom_read_consume_buffer(&SPI_registers[SPI_DATA_REGISTER_INDEX]); // read in another word

