khill25/Dreamdrive/Dreamcast/sw/rp2350/rp2350.cpp
			if (!gdrom_buffer_has_more_data) {
				current_io_mode = IO_MODE_IDLE;
				// Set the status register to indicate the data is finished
				SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
				*status_register = 0x50; // DRQ = 0 BSY = 0
				
				// Do we need to assert the irq line for a read?
				gpio_put(PIN_INTRQ, INTRQ_ASSERT);
			}
		}	

	} else if (current_io_packet_command == CD_PLAY_SEGA_PACKET_CMD) {
		printf("CD_PLAY_SEGA_PACKET_CMD\n");
	} else if (current_io_packet_command == CD_SEEK_SEGA_PACKET_CMD) {
		printf("CD_SEEK_SEGA_PACKET_CMD\n");
	} else if (current_io_packet_command == CD_SCAN_SEGA_PACKET_CMD) {
		printf("CD_SCAN_SEGA_PACKET_CMD\n");
	} else if (current_io_packet_command == CD_READ2_SEGA_PACKET_CMD) {
		printf("CD_READ2_SEGA_PACKET_CMD\n");
	} else if (current_io_packet_command == GET_SCD_SEGA_PACKET_CMD) {
		SPI_registers[SPI_DATA_REGISTER_INDEX] = generic_data_buffer[io_current_position++]; // put next word in data register

		if (io_current_position >= io_ending_position) {

			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x4000FFFF;
			}

			current_io_packet_command = 0;
			io_current_position = 0;
			io_ending_position = 0;
			current_io_mode = IO_MODE_IDLE;

			// Set the status register to indicate the data is finished
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
			*status_register = 0x50; // DRQ = 0 BSY = 0
			
			// Assert the IRQ line to announce we are finished
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);
		}

	} else if (current_io_packet_command == Code71_PACKET_CMD) {
		SPI_registers[SPI_DATA_REGISTER_INDEX] = rom[io_current_position++];
		// SPI_registers[SPI_DATA_REGISTER_INDEX] = reply_71[io_current_position++]; // put next word in data register
		// SPI_registers[SPI_DATA_REGISTER_INDEX] = cmd71_reply[io_current_position++]; // put next word in data register

		if (io_current_position >= io_ending_position) {
			current_io_packet_command = 0;
			io_current_position = 0;
			io_ending_position = 0;
			current_io_mode = IO_MODE_IDLE;

			// Set the status register to indicate the data is finished
			// SPI_registers[SPI_SECTOR_NUMBER_REGISTER_INDEX] = 0x83;
			SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
			*status_register = 0x50; // DRQ = 0 BSY = 0
			
			// Assert the IRQ line to announce we are finished
			gpio_put(PIN_INTRQ, INTRQ_ASSERT);

			if(writtenRegisterIndex < 5000) {
				writtenRegisters[writtenRegisterIndex++] = 0x71FFFFFF;
			}
		}

	} else {
		printf("\nunimplemented current_io_packet: %u\n", current_io_packet_command);
		printf("Resetting all variables\n\n");
		current_io_packet_command = 0;
		io_current_position = 0;
		io_ending_position = 0;
		current_io_mode = IO_MODE_IDLE;

		// Set the status register to indicate the data is finished
		SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0x03; // IO=1, CoD=1
		*status_register = 0x50; // DRQ = 0 BSY = 0
		
		// Assert the IRQ line to announce we are finished
		gpio_put(PIN_INTRQ, INTRQ_ASSERT);
	}

}

void main_processing_loop() {
	printf("Opening default disc image...\n");
	gdrom_read_default_disc_image();
	printf("DONE!\n");

	rom = (uint16_t*)(gdrom_rom_data);

	// printf("TOC dump...\n");
	// GetDriveToc((uint32_t*)(SEGA_PACKET_TOC_INFO), SingleDensity);
	// for(int i = 0; i < 408; i++) {
	// 	if (i % 8 == 0) {
	// 		printf("\n");
	// 	}
	// 	printf("%x ", SEGA_PACKET_TOC_INFO[i]);
	// }
	// printf("DONE!\n");

	spi_packet_register = (uint16_t*)(&SEGA_PACKET_CMD_REGISTER);

	while(1) {
		
		if(time_us_32() - timetrack > 10000000/*60000000*//*18000000*/ && !hasChirped) {
			hasChirped = true;
			timetrack = time_us_32();
			printf("----------------------------------------\n");
			printf("Num Writes: %d\n", writtenRegisterIndex);
			printf("Written Registers:\n");
			int goodWrites = 0;

			// uint32_t v0;
			// uint32_t v1;
			// uint32_t v2;
			// uint32_t loopUntilIndex = writtenRegisterIndex;
			// if (loopUntilIndex > 1500) {
			// 	loopUntilIndex = 1500;
			// }
			// uint8_t isPrintingCommandPacket = 0; // Revist to format command packets
			for(uint32_t i = 0; i < writtenRegisterIndex; i++) {

				// v0 = writtenRegisters[i];
				// v1 = writtenRegisters[i+1];
				// v2 = writtenRegisters[i+2];

				// if (v0 == 0xaaaa || v0 == 0xbbbb) {
				// 	printf("%x\t| %s |\t%x\n", writtenRegisters[i-1], ((v0 == 0xaaaa) ? "READ " : "WRITE"), writtenRegisters[i+1]);
				// 	i += 2;
				// } else {
				printf("%x\n", writtenRegisters[i]);
				// 	i++;
				// }
			}
			
			// Allow this to dump data every minute
			writtenRegisterIndex = 0;
			hasChirped = false;

			// for(int i = 0; i < SPI_REGISTER_COUNT; i++) {
			// 	printNameOfRegister(i);
			// 	printf(" = %x\n", SPI_registers[i]);
			// }

			// printf("----------------------------------------\n");
			// printf("/n/n");
			// printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			// printf("alt status: %x\n", SPI_registers[SPI_ALTERNATE_STATUS_REGISTER_INDEX]);
			// printf("device control: %x\n",SPI_registers[SPI_DEVICE_CONTROL_REGISTER_INDEX]);
			// printf("data: %x\n",SPI_registers[SPI_DATA_REGISTER_INDEX]); 
			// printf("features: %x\n",SPI_registers[SPI_FEATURES_REGISTER_INDEX]);
			// printf("error: %x\n",SPI_registers[SPI_ERROR_REGISTER_INDEX]);
			// printf("interrupt: %x\n",SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX]);
			// printf("sector number: %x\n",SPI_registers[SPI_SECTOR_NUMBER_REGISTER_INDEX]);
			// printf("byte count low: %x\n",SPI_registers[SPI_BYTE_COUNT_REGISTER_LOW_INDEX]); 
			// printf("byte count high: %x\n",SPI_registers[SPI_BYTE_COUNT_REGISTER_HIGH_INDEX]);
			// printf("drive select: %x\n",SPI_registers[SPI_DRIVE_SELECT_REGISTER_INDEX]);
			// printf("status: %x\n",SPI_registers[SPI_STATUS_REGISTER_INDEX]);
			// printf("cmd: %x\n",SPI_registers[SPI_COMMAND_REGISTER_INDEX]);
			// printf("sector count: %x\n", SPI_registers[SPI_SECTOR_COUNT_REGISTER_INDEX]);
			// printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");


