khill25/Dreamdrive/Dreamcast/sw/rp2350/rp2350.cpp
			printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");

		}

		// If we are sending data and in DMA mode
		if(ide_current_transfer_mode && current_io_mode == IO_MODE_WRITE) {
			process_data_read();
		}

		// // Wait for data from core1 to be available
		if(!multicore_fifo_rvalid()) {
			continue;
		}

		// // Get data
		core0CData = multicore_fifo_pop_blocking();

		// if (core1_buffer_index == core0_buffer_index) {
		// 	continue;
		// }

		// if (core1_buffer_index != core0_buffer_index) {
		// 	core0CData = core_command_buffer[core1_buffer_index++];
		// }

		// Please skip all the stupid alt status register reads
		if(writtenRegisterIndex < 5000 && core0CData != 0x4e) {
			writtenRegisters[writtenRegisterIndex++] = core0CData;

			// Debugging for when the dc polls disc status
			// if (core0CData == 0x53) {
			// 	writtenRegisters[writtenRegisterIndex++] = 0x53FFFFFF;
			// 	secnr_poll_count++;
			// 	if (secnr_poll_count > 10) {
			// 		if (secnr_poll_next_status == 0x80) {
			// 			secnr_poll_next_status = 0x81;
			// 		} else if (secnr_poll_next_status == 0x81) {
			// 			secnr_poll_next_status = 0x82;
			// 		} else if (secnr_poll_next_status == 0x82) {
			// 			secnr_poll_next_status = 0x83;
			// 		} else if (secnr_poll_next_status == 0x83) {
			// 			secnr_poll_next_status = 0x80;
			// 		}

			// 		writtenRegisters[writtenRegisterIndex++] = secnr_poll_next_status;
			// 		SPI_registers[SPI_SECTOR_NUMBER_REGISTER_INDEX] = secnr_poll_next_status;
			// 		writtenRegisters[writtenRegisterIndex++] = 0x53AAAAAA;
					
			// 	}
			// }
		}

		// Host has read the status register
		if (core0CData == CODED_STATUS_REGISTER_READ) {
			gpio_put(PIN_INTRQ, INTRQ_DEASSERT); // negate the interrupt line
			continue;
		}

		if (core0CData == CODED_DATA_REGISTER_WRITE) {
			process_data_written();
			continue;
		}

		if (core0CData == CODED_DATA_REGISTER_READ) {
			if (current_io_mode == IO_MODE_WRITE) {
				process_data_read();
			} 
			// This else block seems to be causing a lot of problems
			// I only see it appear after a 0x11 packet command
			// And it should appear for any of the other commands in process_data_read
			// since we write the last word THEN pull the IRQ, and then the DC should read the final
			// word and then clear the irq.
			// This doesn't appear to be working as expected and I have no idea why.....
			// else {
			// 	// printf("ERROR register READ current_io_mode incorrect: %x | %x, %u, %u, dma:%u\n", current_io_mode, current_io_packet_command, io_current_position, io_ending_position, ide_current_transfer_mode);
			// 	if(writtenRegisterIndex < 5000) {
			// 		writtenRegisters[writtenRegisterIndex++] = 0xDEADDDDD;
			// 	}
			// }

			continue;
		}

		// register_index -> selected register 
		// selectedRegister -> register pointer
		// The command register is the only one that needs to be processed (for now)
		if(core0CData == CODED_COMMAND_REGISTER_WRITE) {

			// !!!BSY bit must be set within 400ns, so if we need more time, this bit should be set
			// .. update status register
			*status_register = *status_register | 0x80; // BSY bit set

			// We need to check the command register
			core0commandRegister = SPI_registers[SPI_COMMAND_REGISTER_INDEX];

			// If this is the packet command, it's the most important case
			if (core0commandRegister == ATA_CMD_PACKET_COMMAND) {
				ide_current_mode = DATA_MODE_SPI;

				SPI_registers[SPI_INTERRUPT_REASON_REGISTER_INDEX] = 0b01; // IO, CoD 
				*status_register = 0x58; // set DRQ bit and clear the busy bit
			
			// Otherwise just do a switch case to process the command
			} else {
				switch (*selectedRegister) {
					case ATA_CMD_NOP:{
						// Command can be received when BSY bit is 1 
						// and device should terminate the command currently in execution
						// printf(".");
						break;
					}
					case ATA_CMD_SOFT_RESET: {
						break;
					}
					// case ATA_CMD_PACKET_COMMAND: { // now handled in it's own if block
					// 	// Process sega packet interface
					// 	// ...
					// 	break;
					// }
					case ATA_CMD_IDENTIFY_DEVICE: {
						break;
					}
					case ATA_CMD_EXECUTE_DEVICE_DIAGNOSTIC: {
						break;
					}
					case ATA_CMD_SET_FEATURES: {
						printf("SET_FEATURES\n");
						break;
					}

					
				}
				// IMPORANT this is really important, if something changes status_register, this busy bit might not be needed
				// for now, only clear it after commands that aren't packet command as they don't do anything.
				// Clear BSY bit
				*status_register = *status_register ^ 0x80; 
			}
		}
	}
}

// Store the test functions here so we can get around to organizing them later
void test_gdrom_read() {
	#ifdef DEBUG_TEST
	busy_wait_ms(500);

	// Test the read command
	SEGA_PACKET_CMD_REGISTER[0] = 0x30;
	SEGA_PACKET_CMD_REGISTER[1] = 0x24;
	SEGA_PACKET_CMD_REGISTER[2] = 0x00;
	SEGA_PACKET_CMD_REGISTER[3] = 0xb0;
	SEGA_PACKET_CMD_REGISTER[4] = 0x5e;
	SEGA_PACKET_CMD_REGISTER[5] = 0x00;
	SEGA_PACKET_CMD_REGISTER[6] = 0x00;
	SEGA_PACKET_CMD_REGISTER[7] = 0x00;
	SEGA_PACKET_CMD_REGISTER[8] = 0x00;
	SEGA_PACKET_CMD_REGISTER[9] = 0x00;
	SEGA_PACKET_CMD_REGISTER[10] = 0x07;
	SEGA_PACKET_CMD_REGISTER[11] = 0x00;

	uint32_t endTime = 0;
	uint32_t startTime = time_us_32();
	gdrom_read_start(SEGA_PACKET_CMD_REGISTER, 0);
	endTime = time_us_32();

	printf("Read Time: %u\n", endTime - startTime);

	printf("GDROM Read Test\n");

	printf("SPI Command Packet:\t");
	for(int i = 0; i < 12; i++) {
		printf("(%u)%x ", i, SEGA_PACKET_CMD_REGISTER[i]);
	}
	printf("\n");

	printf("Sector Start: %u(0x%x), Sector Count: %u(0x%x), Sector Size: %u(0x%x)\n", gdrom_read_start_sector, gdrom_read_start_sector, gdrom_read_remaining_sectors, gdrom_read_remaining_sectors, gdrom_read_sector_size, gdrom_read_sector_size);
	printf("Data Buffer:");
	for (int i = 0; i < 32; i++) {
		if (i % 8 == 0) {
			printf("\n%d: ", i);
		}
		printf("%x ", gdrom_read_buffer[i]);
	}

	printf("\nData Register:");
	for (int i = 0; i < 32; i++) {
		gdrom_read_consume_buffer(&SPI_registers[SPI_DATA_REGISTER_INDEX]); // read in another word
		if (i % 8 == 0) {
			printf("\n%d: ", i);
		}
		printf("%x ", SPI_registers[SPI_DATA_REGISTER_INDEX]);
	}
	printf("\n\n");

	// printf("Data_Buffer[0]: %x\n", gdrom_read_buffer[0]);
	// printf("Data Register:  %x\n", SPI_registers[SPI_DATA_REGISTER_INDEX]);

	// Stall here
	while(1);;;
	#endif
}

